tap "homebrew/bundle"

# Core Apps
brew "bash"                                    # Shell
brew "coreutils"                               # GNU Core Utils
brew "git"                                     # Source code manager
brew "gnupg"                                   # GnuPG, for signed Git commits
brew "subversion"                              # Source code manager
brew "tmux"                                    # Terminal multiplexer
brew "vim"                                     # Text editor
brew "zsh"                                     # Shell

# Languages
## Ruby
brew "ruby-build"                              # Builds Ruby
brew "rbenv"                                   # Shim manager for Ruby
## Perl
brew "perl-build"                              # Builds Perl
brew "plenv"                                   # Shim manager for Perl
brew "cpanminus"                               # CLI tool for CPAN
## Python
brew "pyenv"                                   # Shim manager for Python
brew "pipenv"                                  # Python package dependency manager
## Go
brew "goenv"                                   # Shim manager for Golang
## Node
brew "node-build"                              # Builds Node.js
brew "nodenv"                                  # Shim manager for Node.js

# Helpful CLI utilities
brew "bat"                                     # Fancy 'cat' replacement
brew "doggo"                                   # Dig, but awesome
brew "dos2unix"                                # CRLF <-> LF conversion
brew "eza"                                     # Fancy 'ls' replacement
brew "fzf"                                     # Fuzzy finder
brew "gnu-tar"                                 # GNU version of tar
brew "jq"                                      # JSON parser/processor
brew "httpie"                                  # Like 'curl', but easier
brew "pandoc"                                  # Converts between doc formats
brew "ripgrep"                                 # Regex file line searching tool
brew "watch"                                   # Run command on schedule, watch output
brew "yamllint"                                # Lints YAML files.
brew "yq"                                      # YAML parser/processor that works like jq
brew "xan"                                     # CSV toolkit

# Database CLI clients
brew "litecli"                                 # SQLite CLI client
brew "mycli"                                   # MySQL / MariaDB CLI client
brew "pgcli"                                   # PostgreSQL CLI client

# Core Casks
cask "iterm2"                                  # Terminal emulator

# Fonts
cask "font-source-code-pro"                    # Font of choice
cask "font-source-sans-3"                      # Sans font of choice
cask "font-source-serif-4"                     # Serif font of choice

# Public Cloud
brew "tenv"                                    # Shim manager for Terraform

# App Store Apps
brew "mas"                                     # CLI to the App Store

# As needed

# As needed - Casks
# cask "dash"                                    # API browser
# cask "drawio"                                  # Flowcharts
# cask "google-chrome"                           # Web browser
# cask "paw"                                     # API tool
# cask "visual-studio-code"                      # Code editor
# cask "vmware-remote-console"                   # VM consoles from vCenter/ESXi
# cask "wireshark"                               # Network analysis
# cask "xquartz"                                 # X11

# As needed - App Store Apps
# mas "Microsoft Remote Desktop", id: 1295203466 # RDP client
# mas "Windows App", id: 1295203466              # New RDP client

# # Cool, but practically pointless
# brew "neofetch", args: ["without-imagemagick"] # Displays OS Info
