tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"

# Core Apps
brew "bash"                                    # Shell
brew "coreutils"                               # GNU Core Utils
brew "git"                                     # Source code manager
brew "gnupg"                                   # GnuPG, for signed Git commits
brew "subversion"                              # Source code manager
brew "tmux"                                    # Terminal multiplexer
brew "vim"                                     # Text editor
brew "zsh"                                     # Shell

# Languages
## Ruby
brew "ruby-build"                              # Builds Ruby
brew "rbenv"                                   # Shim manager for Ruby
## Python
brew "pyenv"                                   # Shim manager for Python
brew "pipenv"                                  # Python package dependency manager
## Perl
brew "perl-build"                              # Builds Perl
brew "plenv"                                   # Shim manager for Perl
brew "cpanminus"                               # CLI tool for CPAN
## Go
brew "goenv"                                   # Shim manager for Golang
## Node
brew "node-build"                              # Builds Node.js
brew "nodenv"                                  # Shim manager for Node.js

# Helpful CLI utilities
brew "bat"                                     # Fancy 'cat' replacement
brew "dos2unix"                                # CRLF <-> LF conversion
brew "exa"                                     # Fancy 'ls' replacement
brew "fzf"                                     # Fuzzy finder
brew "jq"                                      # JSON parser/processor
brew "httpie"                                  # Like 'curl', but easier
brew "pandoc"                                  # Converts between doc formats
brew "ripgrep"                                 # Regex file line searching tool
brew "thefuck"                                 # Fat finger fixer
brew "watch"                                   # Run command on schedule, watch output
brew "yamllint"                                # Lints YAML files.
brew "xsv"                                     # CSV toolkit

# Database CLI clients
brew "mycli"                                   # MySQL / MariaDB CLI client
brew "pgcli"                                   # PostgreSQL CLI client

# Core Casks
cask "dash"                                    # API browser
cask "docker"                                  # Containers
cask "drawio"                                  # Flowcharts
cask "iterm2"                                  # Terminal emulator
cask "visual-studio-code"                      # Code editor

# Fonts
cask "font-source-code-pro"                    # Font of choice

# Puppet Specific
tap "puppetlabs/puppet"
# brew "wash"                                    # Puppet Wash, doesn't work with latest FUSE
# cask "puppet-agent"                            # Puppet Agent
# cask "puppet-agent-6"
cask "puppet-bolt"                             # Puppet Bolt
# cask "puppet-bolt@2"
cask "pdk"                                     # Puppet Development Kit

# Public Cloud
brew "awscli"                                  # Amazon Web Services CLI
brew "tfenv"                                   # Shim manager for Terraform

# Day-to-day apps
cask "slack"                                   # Collaboration

# App Store Apps
brew "mas"                                     # CLI to the App Store
mas "Microsoft Remote Desktop", id: 1295203466 # RDP client

# As needed
# brew "azure-cli"                               # Microsoft Azure CLI
# brew "mono"                                    # .NET Framework

# As needed - Casks
# cask "google-cloud-sdk"                        # Google Cloud SDK
# cask "google-chrome"                           # Web browser
# cask "powershell"                              # Windows automation & config framework
# cask "vmware-remote-console"                   # VM consoles from vCenter/ESXi
# cask "wireshark"                               # Network analysis
# cask "xquartz"                                 # X11

# As needed - App Store Apps
# mas "Bear", id: 1091189122                     # Note taking app
# mas "SnippetsLab", id: 1006087419              # Code snippet manager

# Cool, but practically pointless
# brew "neofetch", args: ["without-imagemagick"] # Displays OS Info
